Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_The Retreats.tmx
Source language: en
Languages: es_419

source: probably just chasing after another petty thief again.
es_419: Seguro solo está buscando a otro ladronzuelo.

source: but this is the best choice for the cheonryong gang.
es_419: Pero esta es la mejor decisión para los Cheonryong.

source: data entry complete. commencing search.
es_419: Ingreso de datos completo. Comenzando búsqueda.

source: wait a minute...
es_419: Un minuto…

source: I'm surprised.
es_419: Estoy sorprendido.

source: some father he is...
es_419: Qué buen padre…

source: this wasn't just payback against us.
es_419: Esto no fue una simple venganza.

source: Eastern Brine
es_419: Salmuera oriental

source: haha, what are you even talking about?
es_419: Ja, ja, ¿de qué estás hablando?

source: Crap… they saw me!
es_419: Mierda… ¡me vieron!

source: I'll get you home, no problem.
es_419: Voy a regresarte a casa.

source: don't worry, I haven't harvested any of your organs.
es_419: No te preocupes, no extraje ninguno de tus órganos.

source: but we can't afford to leave this money on the table...
es_419: Pero no podemos permitirnos perder tanto dinero…

source: ...who doesn't even have the guts to pull the trigger.
es_419: … que ni siquiera tiene las agallas para disparar.

source: ...and catch that bastard at the same time!
es_419: … ¡y atrapar a ese infeliz al mismo tiempo!

source: why is that?
es_419: ¿Por qué?

source: It's also what they used to call centipedes in old Asia.
es_419: También es como les decían a los ciempiés en la antigua Asia.

source: hmm
es_419: Mmm

source: he's completely lost it.
es_419: Se volvió loco.

source: I can handle the slums...
es_419: Puedo ocuparme de esto solo…

source: ...with all that chaos beyond the walls, none of which we can even see?
es_419: … con todo el caos que hay fuera de los muros y que ni siquiera podemos ver?

source: You've thought of a way, haven't you?
es_419: Ya pensaste en un plan, ¿verdad?

source: … I've never met anyone as greedy as you!
es_419: … ¡nunca conocí a alguien tan codicioso como tú!

source: wow, I guess it's a lot bigger down here than it looks.
es_419: Guau, este sitio es mucho más enorme de lo que parece.

source: we can only do the switch if we somehow lure the kid from the retreats down to brine.
es_419: La única forma de lograrlo es engañando al chico para que venga a Salmuera.

source: I'm not asking you to take me to the retreats for my own sake.
es_419: No te pido que me lleves a El Refugio por mi bien.

source: you're only alive because you're from the retreats and we've got a use for you.
es_419: La única razón por la que estás vivo es porque vienes de El Refugio y puedes sernos útil.

source: after all, all of the money you earned in the retreats is riding on this.
es_419: Al fin y al cabo, estás arriesgando el dinero que ganaste en El Refugio.

source: status : mission accomplished.
es_419: Estado: misión cumplida.

source: I swear, layton, to one day...
es_419: Layton, juro que algún día…

source: we ain't got time for a botany lesson, kid.
es_419: No tenemos tiempo para estudiar botánica, niño.

source: I'll come back with the device in my hand!
es_419: ¡Voy a volver con el recordatón en mano!

source: pioneer your future on jupiter!
es_419: ¡Planea tu futuro en Júpiter!

source: remember, everything you see and hear in the retreats is just an illusion.
es_419: Recuerda, todo lo que ves y escuchas en El Refugio es solo una ilusión.

source: urgghh...
es_419: Aaagh…

source: "If it's impossible, make it possible."
es_419: “Si algo es imposible, hazlo posible”.

source: you heard it yourself from our illustrious client, john canty.
es_419: Ya escucharon lo que dijo John Canty, nuestro ilustre cliente.

source: as such, the people of brine are constantly battling various minor diseases, some of which can be fatal in severe cases.
es_419: Por eso, los residentes de Salmuera sufren constantemente de múltiples enfermedades. Y algunas resultan ser letales.

source: if you really must know, I'll tell you.
es_419: Si tanto quieres saber, te lo diré.

source: I need to get on the next ship to solgaya, right away...
es_419: Necesito subirme cuanto antes al próximo barco a Solgaya…

source: I remember some kid from the academy telling me...
es_419: Recuerdo que un chico de la academia me contó que…

source: greenwood says it's best to take a small number of select members.
es_419: Greenwood dice que es mejor que solo vayamos un selecto grupo de miembros.

source: hmm. in that case...
es_419: Mmm. En ese caso…

source: I don't know, watson.
es_419: No sé, Watson.

source: you think I'll sit back and let that happen, you bastards?!
es_419: ¡¿Creen que voy a quedarme de brazos cruzados, malditos infelices?!

source: ha!
es_419: ¡Ja!

source: ed, don't be too down on yourself.
es_419: Ed, no seas tan duro contigo mismo.

source: ...the slums are full of various machines that have been smuggled in from the retreats.
es_419: … los barrios están llenos de máquinas que han traído de contrabando desde El Refugio.

source: their chief seems completely unhinged though...
es_419: Aunque su jefe parece ser un desquiciado…

source: LEAP
es_419: ZAS

source: dead meat, my ass! we would've found a way out ourselves-!
es_419: ¡Nadie me mata, imbécil! ¡Habríamos hallado la forma de sobrevivir!

source: I almost died, dammit!
es_419: ¡Casi muero, carajo!

source: ...with some enjoying near-eternal lifespans while remaining in their peak physical state.
es_419: … algunos incluso disfrutan vidas casi eternas mientras se mantienen en su mejor estado físico.

source: and that's how biringam, the very first retreats they built...
es_419: Y así fue cómo Biringam, el primer refugio que construyeron…

source: I would like to make my son gable...
es_419: Quiero que mi hijo sea…

source: after all, they don't even see us as human beings!
es_419: ¡Al fin y al cabo, no somos seres humanos para ellos!

source: instead, I decided to give you an opportunity.
es_419: Preferí darte una oportunidad.

source: if you don't... you'll experience more pain than you've ever thought possible before you die.
es_419: Si no… vas a sufrir como nunca antes de morir.

source: chief.
es_419: Jefe.

source: how dare he treat me like that?! he needs to learn some manners!!!
es_419: ¡¿Cómo se atreve a tratarme así?! ¡¡¡Que aprenda modales!!!

source: sure, if we can even make it out of here in one piece.
es_419: Claro, pero primero tenemos que salir de aquí con vida.

source: Where's Chief?
es_419: ¿Y el jefe?

source: gramps! gramps!
es_419: ¡Abuelo! ¡Abuelo!

source: ...that I'd make them pay, no matter what it took.
es_419: … que los haría pagar como diese lugar.

source: back in our time...
es_419: En nuestros tiempos…

source: huh? uh... okay.
es_419: ¿Eh? Bueno… okey.

source: I guess I got lucky...
es_419: Supongo que tengo suerte…

source: that we needed to change things, not destroy them, in order to rebuild.
es_419: de que teníamos que cambiar las cosas, y no destruirlas, para poder reconstruirlas.

source: EPISODE 12
es_419: Episodio 12

source: the rest of his organs seem to be in pretty good condition.
es_419: El resto de sus órganos parecen estar en excelentes condiciones.

source: they've moved again...!
es_419: ¡Volvieron a moverse…!

source: heh... deal.
es_419: Je… trato hecho.

source: I never asked to be saved in the first place! you did that on your own, and now you dare ask for my help in return?!
es_419: ¡Para empezar, no pedí que me salvaran! ¡Lo hiciste porque te dio la gana! ¡¿Y ahora me quieres cobrar un favor?!

source: you there, mr. slumdog.
es_419: Escucha, señor de los barrios.

source: yo, kacey!
es_419: ¡Ey, Kacey!

source: for the last time, shut it!
es_419: ¡Por última vez, cierra la boca!

source: ...is a wristwatch-type mobile device...
es_419: … es un dispositivo móvil que va en la muñeca…

source: there's no way greenwood would fall for that!
es_419: ¡Greenwood jamás se tragaría ese cuento!

source: it might be difficult to believe, but trust me, it's for your own good.
es_419: Puede que sea difícil imaginarlo, pero créeme, es por tu propio bien.

source: is it looking for this old man?
es_419: ¿Está buscando a este anciano?

source: it's so dark and cozy in here...
es_419: Este lugar es muy oscuro y agradable…

source: vulture scum like you always talk too much.
es_419: Los Buitres siempre hablan demasiado.

source: the centipedes’* hideout
es_419: Guarida de los ciempiés*

source: ...they're the spitting image of each other.
es_419: … son la viva imagen el uno del otro.

source: but you always seem to be complaining.
es_419: Pero siempre estás quejándote de algo.

source: yeah, about that... we got lucky that retreats boy back there has good hearing. he's the one who found this place.
es_419: Sí, sobre eso… Tuvimos suerte de que el chico de El Refugio tuviese una buena audición. Él fue quien encontró este lugar.

source: I've got a wife waiting for me at home...!
es_419: ¡Tengo una esposa…!
